{"web_name": "Allrecipes", "id": "Allrecipes--extend--0", "ques": "Identify a highly rated stir-fry tofu recipe on Allrecipes with at least 50 reviews. Include the list of spices needed for the recipe and the total time it takes to prepare and cook.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--1", "ques": "Search for a five-star carrot cake recipe on Allrecipes and include the type of frosting used, the serving size, and any special equipment needed to prepare it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--2", "ques": "Locate a Mexican-style vegetarian burrito recipe on Allrecipes with over 100 reviews. List the key ingredients for the filling and provide the cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--3", "ques": "Find a low-sodium chicken soup recipe on Allrecipes that serves at least four people. Mention the top three herbs used in the recipe and the total preparation time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--4", "ques": "Locate a top-rated shrimp scampi recipe on Allrecipes and list both the amount of pasta and the types of cheese, if any, included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--5", "ques": "Find a four-star or above muffin recipe that incorporates blueberries and oatmeal on Allrecipes. Detail the caloric content per muffin.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--6", "ques": "Search for a French onion soup recipe on Allrecipes with a 4-star rating and provide the list of cheeses included, along with the overall customer ‘thumbs up’ percentage.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--7", "ques": "Identify a brunch-worthy spinach and feta quiche on Allrecipes that contains no meat ingredients and has received at least 60 reviews. Report the number of eggs needed for the recipe and the baking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--8", "ques": "On Allrecipes, find a barbecue ribs recipe suitable for a summer cookout that requires no more than 15 minutes prep time and has a minimum 4-star rating with over 25 reviews. Name the cooking method and the total time to completion.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--9", "ques": "Look for a Greek salad roll-up or wrap recipe on Allrecipes with a prep time less than 30 minutes and more than 20 reviews, and specify the type of bread or wrap used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--10", "ques": "Identify an appetizer recipe featuring goat cheese on Allrecipes with a prep time of 20 minutes or less and at least a 4-star rating with more than 15 reviews.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--11", "ques": "Locate a top-rated (4.5 stars or better) breakfast pancake recipe on Allrecipes that includes banana. List any additional fruits included in the recipe and the time it takes to make it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--12", "ques": "Use Allrecipes to find a vegetarian-friendly pot pie recipe with 40 reviews or more. Provide the list of vegetables used and total estimated cook time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--13", "ques": "Locate a fruit-based smoothie recipe on Allrecipes that uses at least 3 types of fruit and has over 50 reviews with at least a 4-star rating. Summarize the preparation steps.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--14", "ques": "Find a pork tenderloin entree recipe on Allrecipes that includes apples and has at least 20 reviews with a rating of 4 stars or better. List the prep, marinating, and cook times.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--15", "ques": "On Allrecipes, find a salad recipe that uses kale and quinoa and has at least 30 user reviews and a rating of 4 stars or more. List the dressing ingredients and the total preparation time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--16", "ques": "Search for a popular sugar-free dessert on Allrecipes with a minimum of 50 reviews and provide the sweetening alternatives used in the recipe and the total time required to prepare the dessert.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--17", "ques": "Look for a high-rated berry pie recipe on Allrecipes with more than 75 reviews. Note the type of crust recommended and the list of berries required in the recipe, along with cooking and prep time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--18", "ques": "Locate a five-star-rated pumpkin soup recipe on Allrecipes that has been reviewed by at least 30 users. Detail the main spices used and the overall preparation and cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--19", "ques": "Locate an apple pie recipe on Allrecipes that is marked as a \"staff pick\" and has at least 75 reviews. Summarize the crust ingredients and the approximate calories per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--0", "ques": "Locate a pair of noise-cancelling headphones on Amazon with over 1000 customer reviews and a customer rating of at least 4.5 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--1", "ques": "Search for a bamboo cutting board set on Amazon with at least three different sizes included. Look for sets with a rating of 4 stars or better and a price below $30.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--2", "ques": "Find a silk pillowcase on Amazon that is king-sized and comes in a variety of colors, with customer reviews indicating it promotes better sleep and has over 500 reviews.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--3", "ques": "Look for a cold brew coffee maker on Amazon capable of making at least 1 liter (34 oz) of coffee. Prioritize one that is dishwasher safe and has at least a 4-star customer rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--4", "ques": "Find an ergonomic office chair on Amazon that features adjustable lumbar support and mesh back. It should be rated 4 stars or higher and priced under $200.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--5", "ques": "Search for a 20-inch carry-on luggage with spinner wheels on Amazon that is approved for international travel. Select one with a TSA-approved lock and at least 4 stars rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--6", "ques": "Locate a bookcase on Amazon no taller than 5 feet, with at least four shelves and made from solid wood. Look for options with customer ratings of four stars or above.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--7", "ques": "Search for a wireless gaming mouse on Amazon with customizable buttons, at least 10000 DPI, and compatible with Windows 10. Ensure it is under $75 and has 4-star ratings or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--8", "ques": "Find an indoor plant stand on Amazon that can hold multiple pots and is suitable for small spaces. Preferably made of metal with a clean, modern design and customer reviews averaging at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--9", "ques": "Look for a set of white blackout curtains on Amazon that are at least 84 inches long. The product must have a customer rating of 4 stars or higher and be available in a pack of 2 panels.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--10", "ques": "Locate on Amazon a cat tree suitable for large cats, over 24 inches tall, with a built-in scratching post, and check if it's eligible for Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--11", "ques": "Search for a pair of men’s breathable running shoes on Amazon that include a size 11 available in blue, with at least a 4-star rating and priced under $75.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--12", "ques": "Find an organic green tea powder on Amazon that's matcha grade, suitable for baking and latte, check if it is certified USDA Organic and priced below $25.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--13", "ques": "Look up the best-rated ergonomic office chairs on Amazon under $200 with adjustable lumbar support and see which ones offer next-day delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--14", "ques": "Find a wireless, rechargeable gaming mouse on Amazon with at least 7 buttons and a battery life surpassing 20 hours. The price should range from $30 to $60.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--15", "ques": "Search for a set of 100% cotton queen-sized bed sheets on Amazon in light blue, ensure it has a thread count of at least 400 and priced at under $100.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--16", "ques": "On Amazon, find non-toxic wall paint in eggshell finish suitable for a child's bedroom, and verify whether the brand offers a sample for prelim testing, under $50.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--17", "ques": "Identify a 4K Ultra HD Smart LED TV on Amazon that is 55 inches, works with Alexa, showing a selection within $400 to $800. Check for any available discounts.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--18", "ques": "On Amazon, look for a paperback historical fiction novel set during World War II, published in the last 3 months, and priced below $20.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--19", "ques": "Find a bicycle helmet on Amazon fitting adults, featured with an LED safety light, ensure it conforms to U.S. CPSC standards for road biking with a price under $70.", "web": "https://www.amazon.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--0", "ques": "Calculate the standard deviation and mean of the dataset: {4, 8, 15, 16, 23, 42}.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--1", "ques": "Find the weight of molten iron if 150 cm^3 were to be poured into a mold at a temperature of 1550 degrees Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--2", "ques": "Determine the frequency and period of a pendulum with a 0.5-meter string length on Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--3", "ques": "Use matrix operations to calculate the determinant of matrix: [[1, 2, 3], [4, 5, 6], [7, 8, 9]], using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--4", "ques": "Calculate the luminosity of the sun given its absolute magnitude is 4.83.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--5", "ques": "Generate a sequence of the first 10 Fibonacci numbers using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--6", "ques": "Convert an angle of 225 degrees to radians.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--7", "ques": "Forecast the time it would take to travel 30 kilometers by car, assuming an average speed of 60 km/h.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--8", "ques": "Determine the boiling point of ethanol at an altitude of 2000 meters above sea level.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--9", "ques": "Find the oxidation states of each element in the potassium dichromate molecule (K2Cr2O7).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--10", "ques": "Calculate the wavelength of a 528 Hz healing frequency sound wave traveling in air at standard temperature and pressure (STP).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--11", "ques": "Convert 100 square feet to hectares.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--12", "ques": "Analyze the trajectory of a projectile with an initial speed of 50 m/s at an angle of 35 degrees on Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--13", "ques": "Find the date of the next solar eclipse visible from Tokyo, Japan.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--14", "ques": "Estimate the human population of India on January 1, 2025, based on current growth trends.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--15", "ques": "Determine the Schwarzchild radius for an object with a mass of 4 million times that of the Sun.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--16", "ques": "Identify the prime factors of 120,070.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--17", "ques": "Calculate the stopping distance for a car traveling at 60 mph assuming an average deceleration of 7 m/s^2 on a dry asphalt road.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--18", "ques": "Compute the fluid dynamic pressure of water flowing at 3 meters per second at a temperature of 20 degrees Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--19", "ques": "Assess the body mass index (BMI) of a person who is 170 cm tall and weighs 65 kg.", "web": "https://www.wolframalpha.com/"}
