{"web_name": "ESPN", "id": "ESPN--extend--0", "ques": "Obtain the LA Clippers' current season record on ESPN, including wins, losses, and division standing.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--1", "ques": "Find out who the leading rusher is in the current NFL season using statistics available on ESPN. Note their total rushing yards and the team they play for.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--2", "ques": "Look up on ESPN who currently leads the MLB in home runs for the ongoing season, stating their number of home runs and team affiliation.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--3", "ques": "Check the ESPN website for the athlete who has the most goals in the current English Premier League season, recording their goal tally and the club they represent.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--4", "ques": "On ESPN, find the name of the coach for the Miami Heat and provide a summary of their career coaching record as it is listed.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--5", "ques": "Use ESPN to determine where the Boston Bruins stand in the NHL Eastern conference, including their win-loss record and points total.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--6", "ques": "Identify on ESPN the current top seed in the Western Conference for the WNBA, stating their record and winning percentage.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--7", "ques": "Research the French Open winners (singles) from the last year's tournament as listed on ESPN, indicating the male and female champions.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--8", "ques": "Find the Women's College Basketball team ranked number 1 in ESPN's latest polls and note their university and current win-loss record.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--9", "ques": "Based on data from ESPN, outline the world record times for the men's and women's 100-meter dash in Track and Field.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--10", "ques": "Check ESPN for the latest College Football Power Rankings and note which team is at the top.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--11", "ques": "Determine the start time and teams involved in tomorrow’s primetime NFL matchup on ESPN's NFL schedule.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--12", "ques": "Find out who is leading the Premier League in goals this season on ESPN's Soccer Statistics page.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--13", "ques": "Check ESPN for the score of the most recent Los Angeles Dodgers game and provide the winning pitcher's name.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--14", "ques": "Identify the player who currently leads the NHL in assists, as featured on ESPN's NHL statistics leaderboard.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--15", "ques": "Investigate who ESPN experts predict to win the upcoming UFC fight night main event.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--16", "ques": "Retrieve from ESPN the starting quarterbacks for the Sunday Night Football game this week and their respective QB ratings.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--17", "ques": "Access ESPN’s list of top-ranked male tennis players and find out who is number five in the world currently.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--18", "ques": "Gather the win-loss record for the current top-ranked team in ESPN’s NCAA Men's Ice Hockey rankings.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--19", "ques": "On ESPN, find the MLB player currently leading in home runs for this season and provide the player's team and home run count.", "web": "https://www.espn.com/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--0", "ques": "Search for the most cost-efficient Premium Economy flight from Rome to Honolulu with a departure on August 5, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--1", "ques": "Identify which flights from Toronto to Barcelona on September 20, 2024, have the shortest duration.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--2", "ques": "Compare the options for round-trip flights between Las Vegas and Sydney with the filter set for one layover at most for travel starting on August 12, 2024, and ending on August 27, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--3", "ques": "Locate multi-city flight options that start in Paris, visit Tokyo, and then return to Paris with departures around August 15, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--4", "ques": "Research and find the cheapest one-way flight option from Boston to Dublin for August 23, 2024, that departs before noon.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--5", "ques": "Check for any Economy class flights available from Honolulu to London that depart on the afternoon of August 18, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--6", "ques": "List all airlines that offer non-stop flights from Athens to Montreal on July 30, 2024, and display their departure times.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--7", "ques": "Discover flights with the least number of stops from New Orleans to Cape Town with a departure on August 5, 2024, and highlight the most eco-friendly option.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--8", "ques": "Choose an Economy round-trip flight option from Tokyo to Cairo, departing on August 15, 2024, with a preference for a morning departure, and returning on August 30, 2024. Evaluate the options for a layover time of less than 4 hours.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--9", "ques": "Search for the most affordable one-way flight from Toronto to Dubai for a departure on August 4, 2024, specifying if meals are included on the selected flight.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--10", "ques": "Identify the flight from Los Angeles to Tokyo with the fewest layovers on July 25, 2024, highlighting the total flight duration.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--11", "ques": "Determine the best-priced non-stop round-trip flight from San Francisco to Honolulu departing on August 15, 2024, and returning on August 22, 2024, with flexible departure times.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--12", "ques": "Find and report on an economy class round-trip flight from Chicago to Mexico City leaving on August 10, 2024, and coming back on September 10, 2024, with priority for flights under 6 hours in duration.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--13", "ques": "Compare premium economy class tickets from Johannesburg to New Delhi for a flight on August 15, 2024, and present the top three choices ranked by overall flight time.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--14", "ques": "Identify the quickest one-way business class flight from Paris to Sao Paulo on August 3, 2024, and note whether in-flight Wi-Fi is available.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--15", "ques": "Locate a one-way flight from Seattle to Boston on August 23, 2024, that leaves before noon and presents options that include a checked baggage allowance.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--16", "ques": "Find the best-priced round-trip flights from Amsterdam to Cancun that have at most one stop, departing on August 14, 2024, with a return on September 1, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--17", "ques": "Locate a one-way flight with the shortest layover from Singapore to Istanbul on August 30, 2024, preferably departing in the evening.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--18", "ques": "Search for flights with the most generous luggage policies on economy fares from Madrid to Las Vegas departing on July 20, 2024, returning on July 27, 2024, and provide details about luggage fees for extra bags.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--19", "ques": "Determine the shortest total flight time for a direct flight from Vancouver to Sydney departing on July 30, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "GitHub", "id": "GitHub--extend--0", "ques": "Identify the most forked JavaScript repository on GitHub created before 2020. List the repository name and owner's username.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--1", "ques": "Check the issue tracker of the React Native GitHub repository to find out the total number of open issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--2", "ques": "Determine the latest released version number of the Django framework on GitHub, including the release date.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--3", "ques": "Find a Go repository with over 500 stars on GitHub that has 'web server' in its description, and provide the link to the repo.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--4", "ques": "On GitHub, locate any repository with the topic 'cryptocurrency' that has been starred over 300 times, and report the latest commit message.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--5", "ques": "Discover a Python game development repository on GitHub with an active pull request and provide the title of the current most recently updated pull request.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--6", "ques": "Identify and provide a brief description and the owner of the most popular repository under the 'machine-learning' topic that was updated on the current day.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--7", "ques": "Locate the repository of the Linux kernel on GitHub and specify how many watchers it currently has.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--8", "ques": "Find the most actively contributed Kotlin repository by checking the number of unique contributors since the start of the current year and list the name and the main application of the repository.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--9", "ques": "Look up previous release details for the TensorFlow repository from last month and indicate the version number and the date of release.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--10", "ques": "Identify the repository with the 'Data Visualization' topic that has the most stars on GitHub, detailling its name and main language used.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--11", "ques": "Search for the most recent 'good first issue' labeled issue across all repositories on GitHub, and state the name of the repository and the title of the issue.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--12", "ques": "On GitHub, find the most popular repository under the 'API' topic updated this month and provide the owner's username, repository name, and count of open issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--13", "ques": "Identify the most recently opened pull request in the 'facebook/react' repository, including the title, author, and date opened.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--14", "ques": "Find the 'GitHub community guidelines' page and summarize the first three rules listed.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--15", "ques": "Determine which user interface framework repository has the highest number of forks and stars combined on GitHub, including the repository's name and owner.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--16", "ques": "Locate a Docker-related GitHub repository updated in the past 24 hours and outline its last commit message, including the commit's SHA.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--17", "ques": "On GitHub, identify a project within the 'Content Management System (CMS)' category that has been updated in the past week, provide the repository's name, main language, and project description.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--18", "ques": "Find the user with the most followers on GitHub. Provide the username and exact number of followers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--19", "ques": "Discover on GitHub, any public repository with 'Hacktoberfest' topic that has the label 'good for beginners,' and list its name, owner, and description.", "web": "https://github.com/"}