{"web_name": "Booking", "id": "Booking--extend--0", "ques": "Identify three guesthouses in Madrid that allow pets and offer free WiFi for a weekend stay from August 10 to August 12, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--1", "ques": "Find a bed and breakfast in Florence near the historic center with on-site parking available for three nights from August 25 to August 28, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--2", "ques": "Locate an apartment in Paris with a view of the Eiffel Tower, that accommodates 4 adults, available for a one-week stay from August 15 to August 22, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--3", "ques": "Book a Tokyo ryokan with a traditional onsen (hot spring) for two nights from August 5 to August 7, 2024, and has guest ratings of 8.5 or higher.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--4", "ques": "Compare the top 5 budget hotels under 100 USD per night in Reykjavik with the best guest reviews for a 5-night stay from July 24 to July 29, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--5", "ques": "Search for a luxury hotel in Dubai with an infinity pool available for a four-night stay from August 20 to August 24, 2024, for two adults.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--6", "ques": "Find a boutique hotel in Cape Town with a sea view room available for a stay of 10 nights starting from July 30 to August 10, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--7", "ques": "Locate a family-friendly resort in Orlando with free theme park shuttle service, available for 8 nights starting from August 15 to August 23, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--8", "ques": "Choose an all-inclusive hotel in Cancún featuring a spa and wellness center for a week-long honeymoon retreat from August 12 to August 19, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--9", "ques": "Determine the availability of eco-friendly accommodations in Vancouver for a three-night stay from August 1 to August 4, 2024, particularly those that have a green/sustainable property badge.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--10", "ques": "Find a pet-friendly accommodation in Miami Beach that offers a kitchenette in the rooms for a week-long stay starting on August 1, 2024, for two adults and one dog.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--11", "ques": "Search for an apartment in Barcelona with a sea view and balcony available for the weekend of September 9-11, 2024, ensuring it has at least three previous guest ratings with an average score of 8.5 or above.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--12", "ques": "Select a bed and breakfast in Edinburgh within 1 kilometer of the Royal Mile that includes free breakfast and is available for booking for 5 nights, starting on August 10, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--13", "ques": "Look for boutique hotels in Florence with original architecture and modern amenities, with availability for 4 nights starting on July 30, 2024, and booking options with free cancellation.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--14", "ques": "Identify a resort in Phuket at least a 4-star rating, offering Thai cooking classes, for an 8-night stay from August 20 to August 28, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--15", "ques": "Book a serviced apartment in Singapore with a rooftop pool and high-speed internet that is available from September 15 through September 22, 2024, for two adults.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--16", "ques": "Search for an eco-friendly hotel in Vancouver with electric vehicle charging stations, bookable for 4 nights from August 25 to August 29, 2024, and list at least two options.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--17", "ques": "Find a ski-in/ski-out chalet in Aspen for a luxury ski weekend for two from August 22 to August 24, 2024, which must include a fireplace and hot tub as amenities.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--18", "ques": "Locate a farmhouse or country house stay in Tuscany that offers wine-tasting activities and is available for 5 nights for a couple from August 10 through August 15, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--19", "ques": "Find a family-friendly resort in Orlando with a pool and kitchen facilities for a week-long stay starting August 2 to August 9, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--0", "ques": "Find the French translation of the word \"resilience\" on the Cambridge Dictionary and show its phonetic transcription.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--1", "ques": "Navigate to the Cambridge Dictionary's blog section and summarize the main points from a recent article about language learning.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--2", "ques": "Use the Grammar section to learn about conditional sentences, then create your own example of a third conditional sentence following the guidelines provided.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--3", "ques": "Search for the idiomatic expression \"play it by ear\" on Cambridge Dictionary to find its meaning, usage, and come up with an original dialogue that includes the idiom.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--4", "ques": "Refer to the 'English–Italian Dictionary' on Cambridge Dictionary to find the Italian equivalent of the word \"joyful\" and write it down with its necessary article 'the'.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--5", "ques": "Use the Cambridge Dictionary's Thesaurus to find at least one antonym for the adjective \"meticulous\" and compose a clear, contrasting pair of sentences demonstrating the meaning of the two words.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--6", "ques": "Discover and list the various adverb forms of the adjective \"peaceful\" on Cambridge Dictionary and use those adverbs in separate, context-relevant phrases.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--7", "ques": "Investigate the 'Word of the Day' on Cambridge Dictionary, cite the word, its part of speech, and craft a brief, creative story using the word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--8", "ques": "Use the Cambridge Dictionary's 'New Words' section to identify a newly added term, define it, and predict its potential usage within a provided field of interest, such as technology.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--9", "ques": "Find the meaning of \"rapture\" including its synonyms and antonyms on Cambridge Dictionary.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--10", "ques": "Search for the effects of the verb \"plummet\" on Cambridge Dictionary, and compose a sentence explaining a stock market situation using this verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--11", "ques": "Locate the verb \"adjudicate\" in the Cambridge Dictionary and list the different forms of this verb (e.g., past tense, gerund, etc.).", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--12", "ques": "Use Cambridge Dictionary to find three collocations for the noun \"innovation\" and provide an example sentence for each collocation.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--13", "ques": "Identify the word \"serendipity\" in the Cambridge Dictionary, describe its etymology, and write an imaginative sentence that illustrates the word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--14", "ques": "Perform a search of the abbreviation \"i.e.\" in the Cambridge Dictionary and find two example sentences illustrating its correct usage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--15", "ques": "Utilize the Cambridge Dictionary to obtain the plural form of the noun \"thesis,\" along with its pronunciation and a definition suitable for a non-native speaker.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--16", "ques": "Search for \"alliteration\" in the Cambridge Dictionary, list the word's part of speech, and create an alliterative phrase beginning with the letter 'S'.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--17", "ques": "Determine the translation of the word \"culinary\" into French using the Cambridge Dictionary, and then write a simple statement about cooking in French using this word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--18", "ques": "Find the word \"affluent\" in the Cambridge Dictionary, identify whether it's an adjective or noun, and provide two synonyms that could replace it in the sentence \"The affluent neighborhood hosted the annual gala.\"", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--19", "ques": "Use the Cambridge Dictionary to look up the idiomatic expression \"miss the boat\" and provide the meaning along with one example sentence illustrating its usage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--0", "ques": "Find a Master's Degree available on Coursera in the field of Computer Science. Include the name of the degree, the offering university, and the approximate time commitment required per week.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--1", "ques": "Identify a Specialization on Coursera that includes a course on deep learning for image recognition. Mention the Specialization name and list all the courses under it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--2", "ques": "Search for a professional certificate program on Coursera in digital marketing. List the courses included in the program and the total duration to complete the program.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--3", "ques": "Discover courses on Coursera that cover quantum mechanics and are taught by faculties from top-ranked universities. List the names of the courses and corresponding universities.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--4", "ques": "Find and list 3 courses on Environmental Science that offer subtitles in Spanish on Coursera. Provide the names of these courses.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--5", "ques": "Search on Coursera for an online course specifically focused on iOS app development, and include who the course is designed for in terms of skill level.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--6", "ques": "Identify a guided project on Coursera that helps learners understand the basics of cryptocurrency trading. List the prerequisite knowledge or skills, if any.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--7", "ques": "Find a beginner-level course on Coursera teaching the principles of sustainable development. Provide information on the course duration and the instructor's affiliation.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--8", "ques": "Locate a course on Coursera on the topic of machine learning in finance and show what kind of certificate is offered upon completion.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--9", "ques": "Retrieve information about a course sequence on Coursera that covers the topic of 'Blockchain Technologies' from a basic to advanced level. What will be the capstone project for the series?", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--10", "ques": "Locate a beginner-level course on Coursera related to 'Data Visualization'. Provide the course details, including course title, the technology stack covered, and the name of the organization or lecturers providing the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--11", "ques": "Identify an advanced Specialization on Coursera that covers 'Artificial Intelligence for Robotics'. Mention the number of courses within the Specialization and the prerequisites listed, if any.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--12", "ques": "Look for an Intermediate-level Specialization that focuses on 'Full Stack Web Development' on Coursera. Provide the credentials you obtain after completing it, and the taught technologies.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--13", "ques": "Find a course on Coursera that introduces 'Quantum Computing'. Mention its estimated completion time, the university or organization offering it, and any recommended prior knowledge.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--14", "ques": "Search on Coursera for a course titled 'The Science of Well-Being' or related to 'Positive Psychology'. Identify the course duration, the instructor's credentials, and one key topic addressed in the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--15", "ques": "Discover a professional certificate offered by Coursera in 'Cybersecurity'. State the issuing organization, the number of courses it comprises, and highlight one skill or tool that you will learn during the certificate program.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--16", "ques": "Locate a beginner-friendly Specialization on Coursera encompassing 'Leadership Skills'. Provide details regarding how many weeks it generally takes to complete and describe the capstone project (if any).", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--17", "ques": "Search for a Specialization on Coursera that focuses on 'Cloud Computing' and is developed by renowned tech companies. Note the companies involved and list one course from the Specialization that teaches about Serverless Computing.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--18", "ques": "Find a course on Coursera that is centered on 'Behavioural Economics'. State the course's rating, the institution behind it, and outline the main subjects covered throughout its duration.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--19", "ques": "Identify the ongoing teaching certification that qualifies for professional development hours related to curriculum development on Coursera.", "web": "https://www.coursera.org/"}