{"web_name": "Apple", "id": "Apple--extend--0", "ques": "Determine the color options available for the latest Apple Watch Series on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--1", "ques": "Check the upcoming dates for Today at Apple workshops available at the Fifth Avenue New York Apple Store through the Apple website. Choose a date randomly.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--2", "ques": "On the Apple website, find out what the storage capacity is for the base model of the newest iMac.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--3", "ques": "Through the Apple website, verify if the newest version of Apple Maps includes cycling directions for San Francisco, CA.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--4", "ques": "Locate the compatibility requirements for installing the latest macOS version on a MacBook as listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--5", "ques": "On Apple's website, look for the maximum video recording resolution and frame rate supported by the newest iPad Air's rear-camera.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--6", "ques": "Inquire on the Apple website about the AppleCare+ service cost for the latest Mac mini.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--7", "ques": "Find the dimensions and weight specification for the newest MacBook Pro model on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--8", "ques": "Investigate the improvements and new features of the second generation AirPods Pro listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--9", "ques": "Schedule a Genius Bar appointment at the nearest Apple Store for a MacBook repair using Apple's support portal, selecting a date randomly.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--10", "ques": "Determine the battery life expectancy for the latest Apple Watch model when using LTE during workouts as mentioned on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--11", "ques": "Find out if the latest iPhone model available on the Apple website offers dual SIM capabilities and which types of SIM are supported.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--12", "ques": "Locate the environmental report for the newest iMac on Apple's website and list two key ecological features highlighted in the report.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--13", "ques": "Discover what kind of warranty is offered with the purchase of a new Mac mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--14", "ques": "Identify the number of external displays supported by the most recent Mac Pro configuration available at Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--15", "ques": "Retrieve from Apple's website the price for the highest storage option available for the latest model of the iPod Touch without any additional accessories or services.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--16", "ques": "Check on the Apple website and find out which version of Bluetooth technology is supported by the HomePod mini.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--17", "ques": "On the Apple website, investigate if there is any educational pricing or discounts for teachers when purchasing a new iPad and specify any conditions that must be met.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--18", "ques": "Get details from the Apple website about the screen size and resolution specifications for the latest Apple Studio Display.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--19", "ques": "Find out what type of USB ports the newest iMac is equipped with and how many of each type there are.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--0", "ques": "Locate the study with the most recent revision in the Astrology and Astrophysics category on ArXiv, provide its title and revision date.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--1", "ques": "Determine the number of new papers related to 'machine learning bias' in the Computer Science category added to ArXiv last month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--2", "ques": "Look up the current month’s most downloaded Computational Engineering, Finance, and Software ArXiv paper, including the title and number of downloads.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--3", "ques": "Identify any paper related to 'holographic principle' in the High Energy Physics - Theory category on ArXiv from the past year, and provide the author's name(s) and the paper's abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--4", "ques": "Locate the help section of ArXiv and find the guidelines on how to correct a paper that has already been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--5", "ques": "Find the latest paper on stochastic processes that is part of the Mathematics category and summarize the findings.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--6", "ques": "Check ArXiv for the most cited paper from last year within the 'Data Structures and Algorithms' subject class, provide its title and abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--7", "ques": "Search ArXiv for any recent reviews or survey papers published on 'dark matter' in the Cosmology and Nongalactic Astrophysics category. Provide the title and summary for one of the papers.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--8", "ques": "Find out the policy on cross-listing articles on ArXiv and find one example paper that is cross-listed with different categories, mention those categories and the main subject of the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--9", "ques": "See what the most common topics are by looking up the keywords cloud for papers submitted to the Statistics Theory section on ArXiv over the past year.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--10", "ques": "Find out how to check the recent number of article submissions in Quantum Algebra (math.QA) at ArXiv and determine if this number has increased compared to the previous month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--11", "ques": "Explain the steps needed to endorse someone for a new submission to the ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--12", "ques": "Locate the resources on ArXiv that provide statistics about article submissions and report on the most common subject classifications for the current year.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--13", "ques": "Search for the help content regarding the arXiv API and ascertain whether ArXiv permits bulk downloading of articles.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--14", "ques": "Identify the procedure for changing the email address associated with an ArXiv account.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--15", "ques": "Discover how an author can withdraw their paper from ArXiv once it has been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--16", "ques": "Determine the steps required for authors to submit a paper to ArXiv’s High Energy Physics - Phenomenology (hep-ph) section.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--17", "ques": "Look for the current moderators for the Quantitative Biology (q-bio) category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--18", "ques": "Find out whether there are any guidelines for citing arXiv papers and describe the general format.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--19", "ques": "Locate and note the number of submissions to ArXiv in the 'Animation' subcategory under Computer Science in the last two weeks.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--0", "ques": "Identify the main topic of the most recent editorial in the Opinion section of BBC News and summarize its viewpoint.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--1", "ques": "Locate the Science & Environment section and summarize the top story related to climate innovations.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--2", "ques": "Find the latest update on currency exchange rates and economic policy decisions announced in the BBC News Business section.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--3", "ques": "In the Entertainment & Arts section, find the announcement of this year's Booker Prize winner and mention the title of the winning book.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--4", "ques": "Discover a recent BBC News article about space exploration, outlining the main mission goals of the latest spacecraft launched.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--5", "ques": "In the Health section, identify the chief medical officer's latest public health announcement about the annual flu season.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--6", "ques": "Retrieve information from the BBC News Education section on the newest policy changes affecting primary education in the UK.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--7", "ques": "Check the Europe News sub-page for the latest vote or agreement in the European Parliament and discuss what issue it addressed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--8", "ques": "Visit the 'Africa' category under the 'World News' section and find the most recent story about wildlife conservation efforts on the continent. Summarize the species or parks involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--9", "ques": "Find out what the main subject of the most-read article on BBC News is today.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--10", "ques": "Investigate what changes, if any, have been made to the UK's travel restrictions by looking at the most recent article on the travel section.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--11", "ques": "Identify the key points from the latest op-ed piece on climate change featured on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--12", "ques": "Look up the latest education-related news on BBC News and summarize what new policies or reforms have been announced.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--13", "ques": "Go to BBC News's Business section and find out which industry the 'Market Data' is most focused on for the current week.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--14", "ques": "Identify the lead story in the Science section of BBC News and provide a summary of the scientific breakthrough it covers.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--15", "ques": "Search for an article on BBC News that discusses upcoming political elections in any country and indicate which election is being covered.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--16", "ques": "Find an analysis article centered on the current state of healthcare systems on BBC News, particularly focusing on a new technology or innovation mentioned.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--17", "ques": "Determine the focus of the most recent 'Feature' story presented in the Technology section on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--18", "ques": "Seek out information on BBC News about a recently reported criminal case in the UK and describe the charges laid out.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--19", "ques": "Locate an article on BBC News focusing on technological advancements in agriculture and summarize the innovation highlighted.", "web": "https://www.bbc.com/news/"}